function check(){
    var pres_1=" রোগের নাম : বাদামি দাগ রোগ (Brown spot)রোগের কারণ : বাইপোলারিস ওরাইজি (Bipolaris oryzae) নামক ছত্রাক দ্বারা হয়ে থাকে।এ রোগটি চারা অবস্থা থেকে যে কোনো বয়সের ধান গাছে হতে পারে। তবে চারার বয়স বেশি হলে রোগটির প্রকোপ বেশি দেখা যায়। মাটিতে পুষ্টি উপাদানের অভাব বা পানির অভাব হলে রোগের মাত্রা বেড়ে যায়।সুস্থ বীজ বপন করতে হবে; বীজ গরম পানিতে (৫০ ডিগ্রি সে. তাপমাত্রায় ৩০ মিনিট ভিজে রাখতে হবে) শোধন করতে হবে; কার্বেন্ডাজিম (অটোস্টিন) অথবা কার্বোক্সিন + থিরাম (প্রোভ্যাক্স ২০০ ডব্লিউপি) প্রতি কেজি বীজে ২.৫ গ্রাম হারে মিশিয়ে শোধন করতে হবে; জৈব সার ব্যবহার করতে হবে; জমিতে সঠিক পরিমাণ নাইট্রোজেন ও পটাশ সার ব্যবহার করলে রোগ কমে যায়; সঠিক পানি ব্যবস্থাপনা করতে হবে; জমিতে রোগ দেখা দিলে কার্বেন্ডাজিম (অটোস্টিন) প্রতি লিটার পানিতে ১.৫ গ্রাম হারে মিশিয়ে স্প্রে করতে হবে।";

    var pres_2="গিঁট বা নোড ব্লাস্টধান গাছের থোড় বের হওয়ার পর থেকে এ রোগ দেখা যায়। গিঁটে কালো রঙের দাগ সৃষ্টি হয়।  ধীরে ধীরে এ দাগ বেড়ে গিঁট পচে যায়, ফলে ধান গাছ গিঁট বরাবর ভেঙে পড়ে।নেক বা শীষ ব্লাস্টএ রোগ হলে শীষের গোড়া অথবা শীষের শাখা প্রশাখার গোড়ায় কাল দাগ হয়ে পচে যায়। শীষ অথবা শীষের শাখা প্রশাখা ভেঙে পড়ে। ধান চিটা হয়।রোগ প্রতিরোধী জাত ব্যবহার করতে হবে।মাটিতে জৈব সারসহ সুষম মাত্রায় সব ধরনের সার ব্যবহার করতে হবে। আক্রান্ত জমির খড়কুটা পুড়িয়ে ফেলতে হবে এবং ছাই জমিতে মিশিয়ে দিতে হবে। সুস্থ গাছ হতে বীজ সংগ্রহ করতে হবে, দাগি বা অপুষ্ট বীজ বেছে ফেলে দিয়ে সুস্থ বীজ ব্যবহার করতে হবে। রোগের আক্রমণ হলে জমিতে ইউরিয়া সারের উপরিপ্রয়োগ বন্ধ রাখতে হবে। জমিতে সব সময় পানি রাখতে হবে। রোগের শুরুতে হেক্টরপ্রতি ৪০ কেজি (বিঘাপ্রতি ৫ কেজি পটাশ সার উপরিপ্রয়োগ করতে হবে। ট্রাইসাইক্লাজল (ট্রুপার ৭৫ ডব্লিউপি) বা টেবুকোনাজল + ট্রাইফ্লক্সিস্ট্রবিন (নাটিভো৭৫ ডব্লিউপি) প্রতি লিটার পানিতে ১ গ্রাম হারে মিশিয়ে ১০-১৫ দিন পর পর ২-৩ বার স্প্রে করতে হবে।";

    var pres_3=" রোগের নাম : লক্ষীর গুটি (False Smut) রোগের কারণ : উস্টিলাজিনোইডিয়া ভাইরেন্স (Ustilaginoidea virens) নামক ছত্রাক দ্বারা হয়ে থাকে।\nরোগের প্রতিকার : সঠিক মাত্রায় ইউরিয়া সার ব্যবহার করতে হবে। জমির পানি নিষ্কাশন ব্যবস্থা উন্নত করতে হবে। আক্রান্ত গাছ বা শীষ তুলে ফেলা এ রোগ দমনের সবচেয়ে ভালো উপায়। তবে এটি সকাল বেলা আক্রান্ত শীষ পলিব্যাগে সাবধানে আবদ্ধ করে গাছ তুলতে হবে যাতে স্পোর ছড়াতে না পারে। জমিতে রোগ দেখা দিলে কার্বেন্ডাজিম গ্রুপের ছত্রাকনাশক যেমন- অটোস্টিন বা নোইন ১.৫ গ্রাম/লিটার হারে অথবা প্রোপিকোনাজোল (টিল্ট ২৫০ ইসি) ১ মিলি/লিটার হারে পানিতে মিশিয়ে স্প্রে করতে হবে।";

    
    var q1=document.query.question1.value;
    var q2=document.query.question2.value;
    var q3=document.query.question3.value;
    var q4=document.query.question4.value;
    var q5=document.query.question5.value;
    if(q1=="yes"& q2=="yes" & q3=="no" &q4=="no" &q5=="no"){
        document.write(pres_1);
    }
    else if(q1=="no"& q2=="no" & q3=="yes" &q4=="no" &q5=="no"){

        document.write(pres_2);

    }
    else if(q1=="no"& q2=="no" & q3=="no" &q4=="yes" &q5=="yes"){

        document.write(pres_3);

    }

    else if(q1=="yes" & q2=="no" & q3=="no" &q4=="yes" &q5=="yes"){

        document.write(pres_3+"\n"+pres_1);
       

    }
    else if(q1=="no"& q2=="yes" & q3=="no" &q4=="yes" &q5=="yes"){

        document.write(pres_3);
        document.write(pres_1);

    }
    else if(q1=="yes"& q2=="yes" & q3=="yes" &q4=="no" &q5=="no"){

        document.write(pres_1);
        document.write("\n");
        document.write(pres_2);

    }

    else if(q1=="no"& q2=="yes" & q3=="yes" &q4=="no" &q5=="no"){

        document.write(pres_1);
        document.write(pres_2);

    }
    else if(q1=="yes"& q2=="no" & q3=="yes" &q4=="no" &q5=="no"){

        document.write(pres_1);
        document.write(pres_2);

    }
    else if(q1=="no"& q2=="no" & q3=="yes" &q4=="yes" &q5=="no"){

        document.write(pres_2);
        document.write(pres_3);

    }
    else if(q1=="no"& q2=="no" & q3=="yes" &q4=="yes" &q5=="yes"){

        document.write(pres_2);
        
        document.write(pres_3);

    }
    else{
        document.write("দয়া করে সব গুলো প্রশ্নের উত্তর দিন!");
    }
   
}